app/views/users/new.html.erb

SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC
---
      <%= f.label :city %><br />
      <%= f.select  "city_id", options_from_collection_for_select(City.all, "id","name"), class: "form-control" %>