app/views/gossips/show.html.erb

        <p class="card-text"><%= @gossip.content %></p>
        <p class="card-text">Auteur : <%=link_to "#{@gossip.user.first_name}", user_path(:id => @gossip.user.id), :class => "card-text" %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

<h6 class="mt-2 text-center">Commentaires</h6>
<% Comment.where(gossip_id: @id).each_with_index do |comment, index| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 42]]

      <p><%= @comment.content %></p></br>
      <p>de: <%= link_to comment.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]