app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "users"."id" = "gossips"."user_id" WHERE "gossips"."user_id" IN (SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1)  [["city_id", 15]]
---
  def show
    params[:city] = City.find(params[:id])
    @gossips = Gossip.joins(:user).
      where(:user => User.where(city_id: params[:id]))