app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "q:kjcbflk"], ["gossip_id", 66], ["user_id", 44], ["created_at", "2020-08-08 16:49:29.396717"], ["updated_at", "2020-08-08 16:49:29.396717"]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def create
        @comment = Comment.new(content: params[:content], user: User.find(current_user.id), gossip: Gossip.find(params[:gossip_id]))

        if @comment.save
            flash[:success] = "Thanks for your comment #{@comment.user.first_name} !"
            redirect_to :controller => 'gossips', :action => 'show', id: Gossip.find(params[:gossip_id])