app/controllers/gossips_controller.rb

  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    @gossip = Gossip.find(params[:id])
    @comments = Comment.all
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 42]]

  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user: current_user)
    @gossip.user = current_user
# J'ai créé un user anonymous, son id est le 21, du coup le new gossip aura toutjours le user 53 pour l'instant.

    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "MonGossip"], ["content", "sngmlw:lb,"], ["user_id", 39], ["created_at", "2020-08-06 21:20:03.456538"], ["updated_at", "2020-08-06 21:20:03.456538"]]

  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)
      if @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4