app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @user_town = City.find(@user.city_id)

SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC
---
  def new
    @new_person = User.new
    @city = City.all.order(:name)

INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @new_person = User.new(first_name: params[:user][:first_name], last_name: params[:user][:last_name], age: params[:user][:age], email: params[:user][:email], city_id: params[:user][:city_id], password: params[:user][:password], description: params[:user][:description])

    p "==================================================================================================="
    if @new_person.save